In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [2]:
data = {'Yil':[2021, 2020, 2019, 2018, 2017, 2016, 2015, 2010],
       'Aholi soni':[33.9, 33.5, 32.9, 32.5, 31.9, 31.4, 30.9, 28.5],
       "Temp":[1.54, 1.48, 1.56, 1.62, 1.65, 1.66, 1.64, 1.53]}
df = DataFrame(data)

In [3]:
df

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [6]:
df = DataFrame(data, index=range(1,9))
df

    Yil  Aholi soni  Temp
1  2021        33.9  1.54
2  2020        33.5  1.48
3  2019        32.9  1.56
4  2018        32.5  1.62
5  2017        31.9  1.65
6  2016        31.4  1.66
7  2015        30.9  1.64
8  2010        28.5  1.53

In [7]:
df['Davlat'] = 0

In [8]:
df

    Yil  Aholi soni  Temp  Davlat
1  2021        33.9  1.54       0
2  2020        33.5  1.48       0
3  2019        32.9  1.56       0
4  2018        32.5  1.62       0
5  2017        31.9  1.65       0
6  2016        31.4  1.66       0
7  2015        30.9  1.64       0
8  2010        28.5  1.53       0

In [9]:
df = df[['Davlat', 'Aholi soni', 'Temp', 'Yil']]

In [10]:
df

   Davlat  Aholi soni  Temp   Yil
1       0        33.9  1.54  2021
2       0        33.5  1.48  2020
3       0        32.9  1.56  2019
4       0        32.5  1.62  2018
5       0        31.9  1.65  2017
6       0        31.4  1.66  2016
7       0        30.9  1.64  2015
8       0        28.5  1.53  2010

In [11]:
Davlatlar = ['Uzbekiston', 'Tojikiston', 'Armaniston', 'Turkiya', 'Belarussia', 'Nigeria', 'Ozarbayjan', 'Qozogiston']
df.Davlat = Davlatlar

In [12]:
df

       Davlat  Aholi soni  Temp   Yil
1  Uzbekiston        33.9  1.54  2021
2  Tojikiston        33.5  1.48  2020
3  Armaniston        32.9  1.56  2019
4     Turkiya        32.5  1.62  2018
5  Belarussia        31.9  1.65  2017
6     Nigeria        31.4  1.66  2016
7  Ozarbayjan        30.9  1.64  2015
8  Qozogiston        28.5  1.53  2010

In [13]:
df.head()

       Davlat  Aholi soni  Temp   Yil
1  Uzbekiston        33.9  1.54  2021
2  Tojikiston        33.5  1.48  2020
3  Armaniston        32.9  1.56  2019
4     Turkiya        32.5  1.62  2018
5  Belarussia        31.9  1.65  2017

In [14]:
df.Yil

1    2021
2    2020
3    2019
4    2018
5    2017
6    2016
7    2015
8    2010
Name: Yil, dtype: int64

In [15]:
df.T

,1,2,3,4,5,6,7,8
Davlat,Uzbekiston,Tojikiston,Armaniston,Turkiya,Belarussia,Nigeria,Ozarbayjan,Qozogiston
Aholi soni,33.9,33.5,32.9,32.5,31.9,31.4,30.9,28.5
Temp,1.54,1.48,1.56,1.62,1.65,1.66,1.64,1.53
Yil,2021,2020,2019,2018,2017,2016,2015,2010

In [26]:
df=DataFrame(data, columns = ['Davlatlar', 'Aholi soni', "Temp", "O'rtacha umir", 'Yil'], index = range(1,9))

In [27]:
df

  Davlatlar  Aholi soni  Temp O'rtacha umir   Yil
1       NaN        33.9  1.54           NaN  2021
2       NaN        33.5  1.48           NaN  2020
3       NaN        32.9  1.56           NaN  2019
4       NaN        32.5  1.62           NaN  2018
5       NaN        31.9  1.65           NaN  2017
6       NaN        31.4  1.66           NaN  2016
7       NaN        30.9  1.64           NaN  2015
8       NaN        28.5  1.53           NaN  2010

In [30]:
df.Davlatlar = Davlatlar

In [31]:
df

    Davlatlar  Aholi soni  Temp O'rtacha umir   Yil
1  Uzbekiston        33.9  1.54           NaN  2021
2  Tojikiston        33.5  1.48           NaN  2020
3  Armaniston        32.9  1.56           NaN  2019
4     Turkiya        32.5  1.62           NaN  2018
5  Belarussia        31.9  1.65           NaN  2017
6     Nigeria        31.4  1.66           NaN  2016
7  Ozarbayjan        30.9  1.64           NaN  2015
8  Qozogiston        28.5  1.53           NaN  2010

In [46]:
df["O'rtacha umir"] = [65, 60, 70, 65, 60, 75, 80, 65]

In [47]:
df

    Davlatlar  Aholi soni  Temp  O'rtacha umir   Yil
1  Uzbekiston        33.9  1.54             65  2021
2  Tojikiston        33.5  1.48             60  2020
3  Armaniston        32.9  1.56             70  2019
4     Turkiya        32.5  1.62             65  2018
5  Belarussia        31.9  1.65             60  2017
6     Nigeria        31.4  1.66             75  2016
7  Ozarbayjan        30.9  1.64             80  2015
8  Qozogiston        28.5  1.53             65  2010

In [48]:
data1 = {
    'Uzbekistan':  {
        
        2021:33.9, 
        2020:33.5, 
        2019:32.9, 
        2018:32.5, 
        2017:31.9},
    
    'Kazakhstan':{
        
        2021:18.9, 
        2020:18.7, 
        2019:18.5,
        2018:18.3, 
        2017:18.1, 
        2016:17.8}
                    }

data1

{'Uzbekistan': {2021: 33.9, 2020: 33.5, 2019: 32.9, 2018: 32.5, 2017: 31.9},
 'Kazakhstan': {2021: 18.9,
  2020: 18.7,
  2019: 18.5,
  2018: 18.3,
  2017: 18.1,
  2016: 17.8}}

In [49]:
df1 = DataFrame(data1)
df1

      Uzbekistan  Kazakhstan
2021        33.9        18.9
2020        33.5        18.7
2019        32.9        18.5
2018        32.5        18.3
2017        31.9        18.1
2016         NaN        17.8

In [52]:
df1.index.name = 'Yil'
df1

      Uzbekistan  Kazakhstan
Yil
2021        33.9        18.9
2020        33.5        18.7
2019        32.9        18.5
2018        32.5        18.3
2017        31.9        18.1
2016         NaN        17.8

In [53]:
df1.loc[[2020, 2017, 2016]]

      Uzbekistan  Kazakhstan
Yil
2020        33.5        18.7
2017        31.9        18.1
2016         NaN        17.8

In [58]:
df1.iloc[3]

Uzbekistan    32.5
Kazakhstan    18.3
Name: 2018, dtype: float64

In [60]:
indeks = df1.index

In [61]:
indeks[0]

2021

In [62]:
indeks[0:3]

Int64Index([2021, 2020, 2019], dtype='int64', name='Yil')

In [63]:
data2 = {
    'username':{"olim":"olimjon21", "maryam":"maryam2020"},
    'email':{"olim":"olimjon21@mail.ru", "maryam":"maryam20@gmail.com"}
}
data2

{'username': {'olim': 'olimjon21', 'maryam': 'maryam2020'},
 'email': {'olim': 'olimjon21@mail.ru', 'maryam': 'maryam20@gmail.com'}}

In [64]:
df2 = DataFrame(data2)

In [65]:
df2

          username               email
olim     olimjon21   olimjon21@mail.ru
maryam  maryam2020  maryam20@gmail.com

In [70]:
usernames = {"asadbek":"roziboyev177","anvar":"anvarbek223", "olim":"olimtoy", "maryam":"mary334455","javohir":"javohir445"}
emails = {"asadbek":"roziboyev@gmail.com","anvar":"anvar@gmail.com", "olim":"olim@mail.ru", "maryam":"mary33@gmail.com","javohir":"javohir445@gmail.com"}

data = {
    'username':usernames,
    'email':emails
}
df = pd.DataFrame(data)
df2 = df.append(pd.DataFrame(data2))
df2

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_4816\43658693.py:9: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2 = df.append(pd.DataFrame(data2))

             username                 email
asadbek  roziboyev177   roziboyev@gmail.com
anvar     anvarbek223       anvar@gmail.com
olim          olimtoy          olim@mail.ru
maryam     mary334455      mary33@gmail.com
javohir    javohir445  javohir445@gmail.com
olim        olimjon21     olimjon21@mail.ru
maryam     maryam2020    maryam20@gmail.com

In [71]:
df2.index

Index(['asadbek', 'anvar', 'olim', 'maryam', 'javohir', 'olim', 'maryam'], dtype='object')

In [75]:
newindex = pd.Index(['olim', 'matluba','kamron'])
newindex

Index(['olim', 'matluba', 'kamron'], dtype='object')

In [76]:
newindex.isin(df2.index)

array([ True, False, False])

In [77]:
# Indeksning boshqa indeksdan farqini tekshirish
df2.index.difference(newindex)

Index(['anvar', 'asadbek', 'javohir', 'maryam'], dtype='object')

In [78]:
# Ikki indeks to'plami
df2.index.union(newindex)

Index(['anvar', 'asadbek', 'javohir', 'kamron', 'maryam', 'maryam', 'matluba',
       'olim', 'olim'],
      dtype='object')

In [79]:
# .delete() va .drop()

df2.index

Index(['asadbek', 'anvar', 'olim', 'maryam', 'javohir', 'olim', 'maryam'], dtype='object')

In [80]:
df2.index.delete([0,3])

Index(['anvar', 'olim', 'javohir', 'olim', 'maryam'], dtype='object')

In [84]:
df2.index.drop('olim')

Index(['asadbek', 'anvar', 'maryam', 'javohir', 'maryam'], dtype='object')

In [88]:
df2.index.drop(['maryam', 'olim'])

Index(['asadbek', 'anvar', 'javohir'], dtype='object')

df2.index

In [89]:
df2.index

Index(['asadbek', 'anvar', 'olim', 'maryam', 'javohir', 'olim', 'maryam'], dtype='object')

In [92]:
# .insert()

df2.index.insert(4,'posha')

Index(['asadbek', 'anvar', 'olim', 'maryam', 'posha', 'javohir', 'olim',
       'maryam'],
      dtype='object')

In [93]:
# .is_monotonic va .is_unique

df2.index.is_monotonic

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_4816\2875145934.py:3: FutureWarning: is_monotonic is deprecated and will be removed in a future version. Use is_monotonic_increasing instead.
  df2.index.is_monotonic

False

In [94]:
df2.index.is_unique

False

In [95]:
# .unique()

df2.index.unique()

Index(['asadbek', 'anvar', 'olim', 'maryam', 'javohir'], dtype='object')